Hybrid-Memcached-(with-aggre)/ex3_result/memtier_2t_16t_default_datasize_946_cycle_10_result
16        Threads
50        Connections per thread
120       Seconds


ALL STATS
============================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p99 Latency   p99.9 Latency       KB/sec 
----------------------------------------------------------------------------------------------------------------------------
Sets        94815.27          ---          ---         8.42458         8.31900        16.76700        26.23900     91481.92 
Gets           92.39        92.39         0.00         8.48147         8.38300        17.02300        25.98300        91.03 
Waits           0.00          ---          ---             ---             ---             ---             ---          --- 
Totals      94907.66        92.39         0.00         8.42464         8.31900        16.76700        26.23900     91572.96 


Request Latency Distribution
Type     <= msec         Percent
------------------------------------------------------------------------
SET       0.103        0.000
SET       6.527        5.000
SET       7.007       10.000
SET       7.263       15.000
SET       7.423       20.000
SET       7.583       25.000
SET       7.775       30.000
SET       7.935       35.000
SET       8.095       40.000
SET       8.255       45.000
SET       8.319       50.000
SET       8.383       52.500
SET       8.383       55.000
SET       8.447       57.500
SET       8.511       60.000
SET       8.511       62.500
SET       8.575       65.000
SET       8.639       67.500
SET       8.639       70.000
SET       8.703       72.500
SET       8.767       75.000
SET       8.831       76.250
SET       8.831       77.500
SET       8.895       78.750
SET       8.895       80.000
SET       8.959       81.250
SET       9.023       82.500
SET       9.087       83.750
SET       9.151       85.000
SET       9.279       86.250
SET       9.343       87.500
SET       9.471       88.125
SET       9.535       88.750
SET       9.599       89.375
SET       9.727       90.000
SET       9.791       90.625
SET       9.919       91.250
SET      10.047       91.875
SET      10.175       92.500
SET      10.303       93.125
SET      10.431       93.750
SET      10.559       94.062
SET      10.687       94.375
SET      10.751       94.688
SET      10.943       95.000
SET      11.071       95.312
SET      11.263       95.625
SET      11.455       95.938
SET      11.647       96.250
SET      11.903       96.562
SET      12.223       96.875
SET      12.415       97.031
SET      12.671       97.188
SET      12.991       97.344
SET      13.311       97.500
SET      13.631       97.656
SET      14.079       97.812
SET      14.527       97.969
SET      14.975       98.125
SET      15.359       98.281
SET      15.679       98.438
SET      15.807       98.516
SET      15.999       98.594
SET      16.127       98.672
SET      16.255       98.750
SET      16.511       98.828
SET      16.639       98.906
SET      16.767       98.984
SET      16.895       99.062
SET      17.151       99.141
SET      17.279       99.219
SET      17.407       99.258
SET      17.663       99.297
SET      17.791       99.336
SET      18.047       99.375
SET      18.303       99.414
SET      18.559       99.453
SET      18.943       99.492
SET      19.327       99.531
SET      19.711       99.570
SET      20.095       99.609
SET      20.351       99.629
SET      20.607       99.648
SET      20.863       99.668
SET      21.119       99.688
SET      21.375       99.707
SET      21.759       99.727
SET      22.143       99.746
SET      22.399       99.766
SET      22.911       99.785
SET      23.295       99.805
SET      23.551       99.814
SET      23.807       99.824
SET      24.063       99.834
SET      24.447       99.844
SET      24.703       99.854
SET      24.959       99.863
SET      25.343       99.873
SET      25.599       99.883
SET      25.983       99.893
SET      26.367       99.902
SET      26.623       99.907
SET      26.751       99.912
SET      27.007       99.917
SET      27.263       99.922
SET      27.519       99.927
SET      27.775       99.932
SET      28.031       99.937
SET      28.287       99.941
SET      28.543       99.946
SET      28.799       99.951
SET      29.055       99.954
SET      29.183       99.956
SET      29.311       99.958
SET      29.567       99.961
SET      29.695       99.963
SET      29.951       99.966
SET      30.207       99.968
SET      30.463       99.971
SET      30.719       99.973
SET      30.975       99.976
SET      31.103       99.977
SET      31.231       99.978
SET      31.487       99.979
SET      31.615       99.980
SET      31.871       99.982
SET      32.127       99.983
SET      32.255       99.984
SET      32.511       99.985
SET      33.023       99.987
SET      33.279       99.988
SET      33.535       99.988
SET      33.791       99.989
SET      34.303       99.990
SET      34.559       99.990
SET      35.071       99.991
SET      35.583       99.991
SET      36.351       99.992
SET      37.375       99.993
SET      43.263       99.993
SET      66.559       99.994
SET     105.471       99.994
SET     107.519       99.995
SET     117.759       99.995
SET     198.655       99.995
SET     236.543       99.995
SET     276.479       99.996
SET     321.535       99.996
SET     372.735       99.996
SET     432.127       99.997
SET     493.567       99.997
SET     532.479       99.997
SET     569.343       99.997
SET     610.303       99.997
SET     651.263       99.998
SET     692.223       99.998
SET     733.183       99.998
SET     778.239       99.998
SET     823.295       99.998
SET     872.447       99.998
SET     917.503       99.998
SET     946.175       99.999
SET     974.847       99.999
SET     999.423       99.999
SET    1011.711       99.999
SET    1011.711       99.999
SET    1011.711       99.999
[...]
SET    1015.807       99.999
SET    1015.807       99.999
SET    1015.807       99.999
[...]
SET    1019.903       99.999
SET    1019.903       99.999
SET    1019.903       99.999
SET    1019.903      100.000
SET    1019.903      100.000
SET    1019.903      100.000
[...]
SET    1023.999      100.000
SET    1023.999      100.000
---
GET       0.399        0.000
GET       6.655        5.000
GET       7.071       10.000
GET       7.295       15.000
GET       7.487       20.000
GET       7.647       25.000
GET       7.807       30.000
GET       7.999       35.000
GET       8.159       40.000
GET       8.255       45.000
GET       8.383       50.000
GET       8.383       52.500
GET       8.447       55.000
GET       8.511       57.500
GET       8.511       60.000
GET       8.575       62.500
GET       8.639       65.000
GET       8.639       67.500
GET       8.703       70.000
GET       8.767       72.500
GET       8.831       75.000
GET       8.895       76.250
GET       8.895       77.500
GET       8.959       78.750
GET       9.023       80.000
GET       9.023       81.250
GET       9.087       82.500
GET       9.151       83.750
GET       9.279       85.000
GET       9.343       86.250
GET       9.471       87.500
GET       9.535       88.125
GET       9.599       88.750
GET       9.663       89.375
GET       9.727       90.000
GET       9.855       90.625
GET       9.919       91.250
GET       9.983       91.875
GET      10.175       92.500
GET      10.303       93.125
GET      10.495       93.750
GET      10.559       94.062
GET      10.687       94.375
GET      10.751       94.688
GET      10.943       95.000
GET      11.199       95.312
GET      11.327       95.625
GET      11.519       95.938
GET      11.775       96.250
GET      12.159       96.562
GET      12.543       96.875
GET      12.863       97.031
GET      13.183       97.188
GET      13.503       97.344
GET      13.695       97.500
GET      14.271       97.656
GET      14.655       97.812
GET      15.039       97.969
GET      15.359       98.125
GET      15.615       98.281
GET      15.935       98.438
GET      16.127       98.516
GET      16.319       98.594
GET      16.383       98.672
GET      16.639       98.750
GET      16.767       98.828
GET      16.895       98.906
GET      17.023       98.984
GET      17.151       99.062
GET      17.279       99.141
GET      17.663       99.219
GET      17.919       99.258
GET      18.175       99.297
GET      18.559       99.336
GET      18.943       99.375
GET      19.327       99.414
GET      19.583       99.453
GET      20.223       99.492
GET      20.479       99.531
GET      21.503       99.570
GET      21.631       99.609
GET      21.887       99.629
GET      22.143       99.648
GET      22.271       99.668
GET      22.399       99.688
GET      22.783       99.707
GET      23.167       99.727
GET      23.295       99.746
GET      23.807       99.766
GET      24.063       99.785
GET      24.319       99.805
GET      24.447       99.814
GET      24.447       99.824
GET      24.575       99.834
GET      24.831       99.844
GET      24.959       99.854
GET      24.959       99.863
GET      24.959       99.873
GET      25.855       99.883
GET      25.983       99.893
GET      26.495       99.902
GET      26.495       99.907
GET      28.159       99.912
GET      28.159       99.917
GET      28.287       99.922
GET      28.287       99.927
GET      28.415       99.932
GET      28.415       99.937
GET      28.415       99.941
GET      28.799       99.946
GET      28.799       99.951
GET      28.799       99.954
GET      28.927       99.956
GET      28.927       99.958
GET      28.927       99.961
GET      28.927       99.963
GET      30.847       99.966
GET      30.847       99.968
GET      30.847       99.971
GET      32.255       99.973
GET      32.255       99.976
GET      32.255       99.977
GET      32.255       99.978
GET      32.255       99.979
GET      32.255       99.980
GET      32.255       99.982
GET      32.383       99.983
GET      32.383       99.984
GET      32.383       99.985
GET      32.383       99.987
GET      32.383       99.988
GET      32.383       99.988
GET      32.383       99.989
GET      32.383       99.990
GET      32.383       99.990
GET      32.383       99.991
GET      35.071       99.991
GET      35.071      100.000
---
WAIT      0.000      100.000